Corentin-proj/FOC_stepper/TM4C123GXL/tivaware/sensorlib/hw_mpu9150.h
//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_ACCEL_CONFIG
// register.
//
//*****************************************************************************
#define MPU9150_ACCEL_CONFIG_XA_ST                                            \
                                0x80        // X-axis accelerometer self-test
                                            // enable
#define MPU9150_ACCEL_CONFIG_YA_ST                                            \
                                0x40        // Y-axis accelerometer self-test
                                            // enable
#define MPU9150_ACCEL_CONFIG_ZA_ST                                            \
                                0x20        // Z-axis accelerometer self-test
                                            // enable
#define MPU9150_ACCEL_CONFIG_AFS_SEL_M                                        \
                                0x18        // Accelerometer full-scale range
#define MPU9150_ACCEL_CONFIG_AFS_SEL_2G                                       \
                                0x00        // Accelerometer full-scale range 2
                                            // g
#define MPU9150_ACCEL_CONFIG_AFS_SEL_4G                                       \
                                0x08        // Accelerometer full-scale range 4
                                            // g
#define MPU9150_ACCEL_CONFIG_AFS_SEL_8G                                       \
                                0x10        // Accelerometer full-scale range 8
                                            // g
#define MPU9150_ACCEL_CONFIG_AFS_SEL_16G                                      \
                                0x18        // Accelerometer full-scale range
                                            // 16 g
#define MPU9150_ACCEL_CONFIG_ACCEL_HPF_M                                      \
                                0x07        // High-pass filter setting
#define MPU9150_ACCEL_CONFIG_ACCEL_HPF_RESET                                  \
                                0x00        // High-pass filter reset
#define MPU9150_ACCEL_CONFIG_ACCEL_HPF_5HZ                                    \
                                0x01        // High-pass filter at 5 Hz
#define MPU9150_ACCEL_CONFIG_ACCEL_HPF_2_5HZ                                  \
                                0x02        // High-pass filter at 2.5 Hz
#define MPU9150_ACCEL_CONFIG_ACCEL_HPF_1_25HZ                                 \
                                0x03        // High-pass filter at 1.25 Hz
#define MPU9150_ACCEL_CONFIG_ACCEL_HPF_0_63HZ                                 \
                                0x04        // High-pass filter at 0.63 Hz
#define MPU9150_ACCEL_CONFIG_ACCEL_HPF_HOLD                                   \
                                0x07        // High-pass filter hold
#define MPU9150_ACCEL_CONFIG_AFS_SEL_S                                        \
                                3
#define MPU9150_ACCEL_CONFIG_ACCEL_HPF_S                                      \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_FF_THR
// register.
//
//*****************************************************************************
#define MPU9150_FF_THR_M        0xFF        // Free-fall threshold value
#define MPU9150_FF_THR_S        0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_FF_DUR
// register.
//
//*****************************************************************************
#define MPU9150_FF_DUR_M        0xFF        // Free-fall duration value
#define MPU9150_FF_DUR_S        0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_MOT_THR
// register.
//
//*****************************************************************************
#define MPU9150_MOT_THR_M       0xFF        // Motion detection threshold value
#define MPU9150_MOT_THR_S       0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_MOT_DUR
// register.
//
//*****************************************************************************
#define MPU9150_MOT_DUR_M       0xFF        // Motion detection duration value
#define MPU9150_MOT_DUR_S       0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_ZRMOT_THR
// register.
//
//*****************************************************************************
#define MPU9150_ZRMOT_THR_M     0xFF        // Zero motion detection threshold
                                            // value
#define MPU9150_ZRMOT_THR_S     0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_ZRMOT_DUR
// register.
//
//*****************************************************************************
#define MPU9150_ZRMOT_DUR_M     0xFF        // Zero motion detection duration
                                            // value
#define MPU9150_ZRMOT_DUR_S     0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_FIFO_EN
// register.
//
//*****************************************************************************
#define MPU9150_FIFO_EN_TEMP    0x80        // Temperature sensor FIFO enable
#define MPU9150_FIFO_EN_XG      0x40        // X-axis gyro FIFO enable
#define MPU9150_FIFO_EN_YG      0x20        // Y-axis gyro FIFO enable
#define MPU9150_FIFO_EN_ZG      0x10        // Z-axis gyro FIFO enable
#define MPU9150_FIFO_EN_ACCEL   0x08        // Accelerometer FIFO enable
#define MPU9150_FIFO_EN_SLV2    0x04        // Slave 2 FIFO enable
#define MPU9150_FIFO_EN_SLV1    0x02        // Slave 1 FIFO enable
#define MPU9150_FIFO_EN_SLV0    0x01        // Slave 0 FIFO enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_MST_CTRL
// register.
//
//*****************************************************************************
#define MPU9150_I2C_MST_CTRL_MULT_MST_EN                                      \
                                0x80        // Multi-master enable
#define MPU9150_I2C_MST_CTRL_WAIT_FOR_ES                                      \
                                0x40        // Wait for external sensor data
#define MPU9150_I2C_MST_CTRL_SLV3_FIFO_EN                                     \
                                0x20        // Slave 3 FIFO enable
#define MPU9150_I2C_MST_CTRL_I2C_MST_P_NSR                                    \
                                0x10        // No repeated start conditions
#define MPU9150_I2C_MST_CTRL_I2C_MST_CLK_M                                    \
                                0x0F        // I2C master clock speed
#define MPU9150_I2C_MST_CTRL_I2C_MST_CLK_348                                  \
                                0x00        // 348 kHz I2C master clock
#define MPU9150_I2C_MST_CTRL_I2C_MST_CLK_333                                  \
                                0x01        // 333 kHz I2C master clock
#define MPU9150_I2C_MST_CTRL_I2C_MST_CLK_320                                  \
                                0x02        // 320 kHz I2C master clock
#define MPU9150_I2C_MST_CTRL_I2C_MST_CLK_308                                  \
                                0x03        // 308 kHz I2C master clock
#define MPU9150_I2C_MST_CTRL_I2C_MST_CLK_296                                  \
                                0x04        // 296 kHz I2C master clock
#define MPU9150_I2C_MST_CTRL_I2C_MST_CLK_286                                  \
                                0x05        // 286 kHz I2C master clock
#define MPU9150_I2C_MST_CTRL_I2C_MST_CLK_276                                  \
                                0x06        // 276 kHz I2C master clock
#define MPU9150_I2C_MST_CTRL_I2C_MST_CLK_267                                  \
                                0x07        // 267 kHz I2C master clock
#define MPU9150_I2C_MST_CTRL_I2C_MST_CLK_258                                  \
                                0x08        // 258 kHz I2C master clock
#define MPU9150_I2C_MST_CTRL_I2C_MST_CLK_500                                  \
                                0x09        // 500 kHz I2C master clock
#define MPU9150_I2C_MST_CTRL_I2C_MST_CLK_471                                  \
                                0x0A        // 471 kHz I2C master clock
#define MPU9150_I2C_MST_CTRL_I2C_MST_CLK_444                                  \
                                0x0B        // 444 kHz I2C master clock
#define MPU9150_I2C_MST_CTRL_I2C_MST_CLK_421                                  \
                                0x0C        // 421 kHz I2C master clock
#define MPU9150_I2C_MST_CTRL_I2C_MST_CLK_400                                  \
                                0x0D        // 400 kHz I2C master clock
#define MPU9150_I2C_MST_CTRL_I2C_MST_CLK_381                                  \
                                0x0E        // 381 kHz I2C master clock
#define MPU9150_I2C_MST_CTRL_I2C_MST_CLK_364                                  \
                                0x0F        // 364 kHz I2C master clock
#define MPU9150_I2C_MST_CTRL_I2C_MST_CLK_S                                    \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_SLV0_ADDR
// register.
//
//*****************************************************************************
#define MPU9150_I2C_SLV0_ADDR_RW                                              \
                                0x80        // Read/not write
#define MPU9150_I2C_SLV0_ADDR_M 0x7F        // Slave address
#define MPU9150_I2C_SLV0_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_SLV0_REG
// register.
//
//*****************************************************************************
#define MPU9150_I2C_SLV0_REG_M  0xFF        // Slave register number
#define MPU9150_I2C_SLV0_REG_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_SLV0_CTRL
// register.
//
//*****************************************************************************
#define MPU9150_I2C_SLV0_CTRL_EN                                              \
                                0x80        // Enable slave
#define MPU9150_I2C_SLV0_CTRL_BYTE_SW                                         \
                                0x40        // Byte-swap word pairs
#define MPU9150_I2C_SLV0_CTRL_REG_DIS                                         \
                                0x20        // Disable register number transfer
#define MPU9150_I2C_SLV0_CTRL_GRP                                             \
                                0x10        // Word pair grouping
#define MPU9150_I2C_SLV0_CTRL_LEN_M                                           \
                                0x0F        // Number of bytes to transfer
#define MPU9150_I2C_SLV0_CTRL_LEN_S                                           \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_SLV1_ADDR
// register.
//
//*****************************************************************************
#define MPU9150_I2C_SLV1_ADDR_RW                                              \
                                0x80        // Read/not write
#define MPU9150_I2C_SLV1_ADDR_M 0x7F        // Slave address
#define MPU9150_I2C_SLV1_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_SLV1_REG
// register.
//
//*****************************************************************************
#define MPU9150_I2C_SLV1_REG_M  0xFF        // Slave register number
#define MPU9150_I2C_SLV1_REG_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_SLV1_CTRL
// register.
//
//*****************************************************************************
#define MPU9150_I2C_SLV1_CTRL_EN                                              \
                                0x80        // Enable slave
#define MPU9150_I2C_SLV1_CTRL_BYTE_SW                                         \
                                0x40        // Byte-swap word pairs
#define MPU9150_I2C_SLV1_CTRL_REG_DIS                                         \
                                0x20        // Disable register number transfer
#define MPU9150_I2C_SLV1_CTRL_GRP                                             \
                                0x10        // Word pair grouping
#define MPU9150_I2C_SLV1_CTRL_LEN_M                                           \
                                0x0F        // Number of bytes to transfer
#define MPU9150_I2C_SLV1_CTRL_LEN_S                                           \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_SLV2_ADDR
// register.
//
//*****************************************************************************
#define MPU9150_I2C_SLV2_ADDR_RW                                              \
                                0x80        // Read/not write
#define MPU9150_I2C_SLV2_ADDR_M 0x7F        // Slave address
#define MPU9150_I2C_SLV2_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_SLV2_REG
// register.
//
//*****************************************************************************
#define MPU9150_I2C_SLV2_REG_M  0xFF        // Slave register number
#define MPU9150_I2C_SLV2_REG_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_SLV2_CTRL
// register.
//
//*****************************************************************************
#define MPU9150_I2C_SLV2_CTRL_EN                                              \
                                0x80        // Enable slave
#define MPU9150_I2C_SLV2_CTRL_BYTE_SW                                         \
                                0x40        // Byte-swap word pairs
#define MPU9150_I2C_SLV2_CTRL_REG_DIS                                         \
                                0x20        // Disable register number transfer
#define MPU9150_I2C_SLV2_CTRL_GRP                                             \
                                0x10        // Word pair grouping
#define MPU9150_I2C_SLV2_CTRL_LEN_M                                           \
                                0x0F        // Number of bytes to transfer
#define MPU9150_I2C_SLV2_CTRL_LEN_S                                           \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_SLV3_ADDR
// register.
//
//*****************************************************************************
#define MPU9150_I2C_SLV3_ADDR_RW                                              \
                                0x80        // Read/not write
#define MPU9150_I2C_SLV3_ADDR_M 0x7F        // Slave address
#define MPU9150_I2C_SLV3_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_SLV3_REG
// register.
//
//*****************************************************************************
#define MPU9150_I2C_SLV3_REG_M  0xFF        // Slave register number
#define MPU9150_I2C_SLV3_REG_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_SLV3_CTRL
// register.
//
//*****************************************************************************
#define MPU9150_I2C_SLV3_CTRL_EN                                              \
                                0x80        // Enable slave
#define MPU9150_I2C_SLV3_CTRL_BYTE_SW                                         \
                                0x40        // Byte-swap word pairs
#define MPU9150_I2C_SLV3_CTRL_REG_DIS                                         \
                                0x20        // Disable register number transfer
#define MPU9150_I2C_SLV3_CTRL_GRP                                             \
                                0x10        // Word pair grouping
#define MPU9150_I2C_SLV3_CTRL_LEN_M                                           \
                                0x0F        // Number of bytes to transfer
#define MPU9150_I2C_SLV3_CTRL_LEN_S                                           \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_SLV4_ADDR
// register.
//
//*****************************************************************************
#define MPU9150_I2C_SLV4_ADDR_RW                                              \
                                0x80        // Read/not write
#define MPU9150_I2C_SLV4_ADDR_M 0x7F        // Slave address
#define MPU9150_I2C_SLV4_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_SLV4_REG
// register.
//
//*****************************************************************************
#define MPU9150_I2C_SLV4_REG_M  0xFF        // Slave register number
#define MPU9150_I2C_SLV4_REG_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_SLV4_CTRL
// register.
//
//*****************************************************************************
#define MPU9150_I2C_SLV4_CTRL_EN                                              \
                                0x80        // Enable slave
#define MPU9150_I2C_SLV4_CTRL_INT_EN                                          \
                                0x40        // Interrupt enable
#define MPU9150_I2C_SLV4_CTRL_REG_DIS                                         \
                                0x20        // Disable register number transfer
#define MPU9150_I2C_SLV4_CTRL_I2C_MST_DLY_M                                   \
                                0x1F        // Slave access delay
#define MPU9150_I2C_SLV4_CTRL_I2C_MST_DLY_S                                   \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_SLV4_DI
// register.
//
//*****************************************************************************
#define MPU9150_I2C_SLV4_DI_M   0xFF        // Input data
#define MPU9150_I2C_SLV4_DI_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_MST_STATUS
// register.
//
//*****************************************************************************
#define MPU9150_I2C_MST_STATUS_PASS_THROUGH                                   \
                                0x80        // Pass through FSYNC interrupt
                                            // status
#define MPU9150_I2C_MST_STATUS_I2C_SLV4_DONE                                  \
                                0x40        // I2C slave 4 completion status
#define MPU9150_I2C_MST_STATUS_I2C_LOST_ARB                                   \
                                0x20        // I2C arbitration lost status
#define MPU9150_I2C_MST_STATUS_I2C_SLV4_NACK                                  \
                                0x10        // I2C slave 4 NACK status
#define MPU9150_I2C_MST_STATUS_I2C_SLV3_NACK                                  \
                                0x08        // I2C slave 3 NACK status
#define MPU9150_I2C_MST_STATUS_I2C_SLV2_NACK                                  \
                                0x04        // I2C slave 2 NACK status
#define MPU9150_I2C_MST_STATUS_I2C_SLV1_NACK                                  \
                                0x02        // I2C slave 1 NACK status
#define MPU9150_I2C_MST_STATUS_I2C_SLV0_NACK                                  \
                                0x01        // I2C slave 0 NACK status

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_INT_PIN_CFG
// register.
//
//*****************************************************************************
#define MPU9150_INT_PIN_CFG_INT_LEVEL                                         \
                                0x80        // INT pin active low
#define MPU9150_INT_PIN_CFG_INT_OPEN                                          \
                                0x40        // INT pin open-drain
#define MPU9150_INT_PIN_CFG_LATCH_INT_EN                                      \
                                0x20        // Latch INT pin output
#define MPU9150_INT_PIN_CFG_INT_RD_CLEAR                                      \
                                0x10        // Interrupt clear on any read
#define MPU9150_INT_PIN_CFG_FSYNC_INT_LEVEL                                   \
                                0x08        // FSYNC pin active low
#define MPU9150_INT_PIN_CFG_FSYNC_INT_EN                                      \
                                0x04        // FSYNC pin interrupt enable
#define MPU9150_INT_PIN_CFG_I2C_BYPASS_EN                                     \
                                0x02        // I2C bypass enable
#define MPU9150_INT_PIN_CFG_CLKOUT_EN                                         \
                                0x01        // CLKOUT enable

