Corentin-proj/FOC_stepper/TM4C123GXL/tivaware/sensorlib/hw_mpu9150.h
//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_INT_ENABLE
// register.
//
//*****************************************************************************
#define MPU9150_INT_ENABLE_FF_EN                                              \
                                0x80        // Free-fall interrupt enable
#define MPU9150_INT_ENABLE_MOT_EN                                             \
                                0x40        // Motion detection interrupt
                                            // enable
#define MPU9150_INT_ENABLE_ZMOT_EN                                            \
                                0x20        // Zero motion interrupt enable
#define MPU9150_INT_ENABLE_FIFO_OFLOW_EN                                      \
                                0x10        // FIFO overflow interrupt enable
#define MPU9150_INT_ENABLE_I2C_MST_INT_EN                                     \
                                0x08        // I2C master interrupt enable
#define MPU9150_INT_ENABLE_DATA_RDY_EN                                        \
                                0x01        // Data ready interrupt enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_INT_STATUS
// register.
//
//*****************************************************************************
#define MPU9150_INT_STATUS_FF_INT                                             \
                                0x80        // Free-fall interrupt status
#define MPU9150_INT_STATUS_MOT_INT                                            \
                                0x40        // Motion detection interrupt
                                            // status
#define MPU9150_INT_STATUS_ZMOT_INT                                           \
                                0x20        // Zero motion interrupt status
#define MPU9150_INT_STATUS_FIFO_OFLOW_INT                                     \
                                0x10        // FIFO overflow interrupt status
#define MPU9150_INT_STATUS_I2C_MST_INT                                        \
                                0x08        // I2C master interrupt status
#define MPU9150_INT_STATUS_DATA_RDY_INT                                       \
                                0x01        // Data ready interrupt status

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_ACCEL_XOUT_H
// register.
//
//*****************************************************************************
#define MPU9150_ACCEL_XOUT_H_M  0xFF        // Bits [15:8] of X-axis
                                            // acceleration data
#define MPU9150_ACCEL_XOUT_H_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_ACCEL_XOUT_L
// register.
//
//*****************************************************************************
#define MPU9150_ACCEL_XOUT_L_M  0xFF        // Bits [7:0] of X-axis
                                            // acceleration data
#define MPU9150_ACCEL_XOUT_L_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_ACCEL_YOUT_H
// register.
//
//*****************************************************************************
#define MPU9150_ACCEL_YOUT_H_M  0xFF        // Bits [15:8] of Y-axis
                                            // acceleration data
#define MPU9150_ACCEL_YOUT_H_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_ACCEL_YOUT_L
// register.
//
//*****************************************************************************
#define MPU9150_ACCEL_YOUT_L_M  0xFF        // Bits [7:0] of Y-axis
                                            // acceleration data
#define MPU9150_ACCEL_YOUT_L_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_ACCEL_ZOUT_H
// register.
//
//*****************************************************************************
#define MPU9150_ACCEL_ZOUT_H_M  0xFF        // Bits [15:8] of Z-axis
                                            // acceleration data
#define MPU9150_ACCEL_ZOUT_H_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_ACCEL_ZOUT_L
// register.
//
//*****************************************************************************
#define MPU9150_ACCEL_ZOUT_L_M  0xFF        // Bits [7:0] of Z-axis
                                            // acceleration data
#define MPU9150_ACCEL_ZOUT_L_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_TEMP_OUT_H
// register.
//
//*****************************************************************************
#define MPU9150_ACCEL_TEMP_OUT_H_M                                            \
                                0xFF        // Bits [15:8] of temperature data
#define MPU9150_ACCEL_TEMP_OUT_H_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_TEMP_OUT_L
// register.
//
//*****************************************************************************
#define MPU9150_ACCEL_TEMP_OUT_L_M                                            \
                                0xFF        // Bits [7:0] of temperature data
#define MPU9150_ACCEL_TEMP_OUT_L_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_GYRO_XOUT_H
// register.
//
//*****************************************************************************
#define MPU9150_GYRO_XOUT_H_M   0xFF        // Bits [15:8] of X-axis gyro data
#define MPU9150_GYRO_XOUT_H_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_GYRO_XOUT_L
// register.
//
//*****************************************************************************
#define MPU9150_GYRO_XOUT_L_M   0xFF        // Bits [7:0] of X-axis gyro data
#define MPU9150_GYRO_XOUT_L_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_GYRO_YOUT_H
// register.
//
//*****************************************************************************
#define MPU9150_GYRO_YOUT_H_M   0xFF        // Bits [15:8] of Y-axis gyro data
#define MPU9150_GYRO_YOUT_H_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_GYRO_YOUT_L
// register.
//
//*****************************************************************************
#define MPU9150_GYRO_YOUT_L_M   0xFF        // Bits [7:0] of Y-axis gyro data
#define MPU9150_GYRO_YOUT_L_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_GYRO_ZOUT_H
// register.
//
//*****************************************************************************
#define MPU9150_GYRO_ZOUT_H_M   0xFF        // Bits [15:8] of Z-axis gyro data
#define MPU9150_GYRO_ZOUT_H_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_GYRO_ZOUT_L
// register.
//
//*****************************************************************************
#define MPU9150_GYRO_ZOUT_L_M   0xFF        // Bits [7:0] of Z-axis gyro data
#define MPU9150_GYRO_ZOUT_L_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_00 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_00_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_00_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_01 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_01_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_01_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_02 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_02_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_02_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_03 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_03_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_03_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_04 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_04_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_04_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_05 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_05_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_05_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_06 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_06_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_06_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_07 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_07_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_07_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_08 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_08_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_08_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_09 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_09_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_09_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_10 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_10_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_10_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_11 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_11_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_11_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_12 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_12_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_12_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_13 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_13_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_13_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_14 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_14_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_14_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_15 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_15_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_15_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_16 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_16_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_16_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_17 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_17_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_17_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_18 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_18_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_18_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_19 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_19_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_19_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_20 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_20_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_20_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_21 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_21_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_21_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_22 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_22_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_22_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_EXT_SENS_DATA_23 register.
//
//*****************************************************************************
#define MPU9150_EXT_SENS_DATA_23_M                                            \
                                0xFF        // External sensor data
#define MPU9150_EXT_SENS_DATA_23_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_MOT_DETECT_STATUS register.
//
//*****************************************************************************
#define MPU9150_MOT_DETECT_STATUS_MOT_XNEG                                    \
                                0x80        // Negative X-axis motion detect
                                            // status
#define MPU9150_MOT_DETECT_STATUS_MOT_XPOS                                    \
                                0x40        // Positive X-axis motion detect
                                            // status
#define MPU9150_MOT_DETECT_STATUS_MOT_YNEG                                    \
                                0x20        // Negative Y-axis motion detect
                                            // status
#define MPU9150_MOT_DETECT_STATUS_MOT_YPOS                                    \
                                0x10        // Positive Y-axis motion detect
                                            // status
#define MPU9150_MOT_DETECT_STATUS_MOT_ZNEG                                    \
                                0x08        // Negative Z-axis motion detect
                                            // status
#define MPU9150_MOT_DETECT_STATUS_MOT_ZPOS                                    \
                                0x04        // Positive Z-axis motion detect
                                            // status
#define MPU9150_MOT_DETECT_STATUS_MOT_ZRMOT                                   \
                                0x01        // Zero motion detect status

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_SLV0_DO
// register.
//
//*****************************************************************************
#define MPU9150_I2C_SLV0_DO_M   0xFF        // Output data
#define MPU9150_I2C_SLV0_DO_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_SLV1_DO
// register.
//
//*****************************************************************************
#define MPU9150_I2C_SLV1_DO_M   0xFF        // Output data
#define MPU9150_I2C_SLV1_DO_S   0

