Corentin-proj/FOC_stepper/TM4C123GXL/tivaware/sensorlib/hw_mpu9150.h
//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_SLV2_DO
// register.
//
//*****************************************************************************
#define MPU9150_I2C_SLV2_DO_M   0xFF        // Output data
#define MPU9150_I2C_SLV2_DO_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_I2C_SLV3_DO
// register.
//
//*****************************************************************************
#define MPU9150_I2C_SLV3_DO_M   0xFF        // Output data
#define MPU9150_I2C_SLV3_DO_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_I2C_MST_DELAY_CTRL register.
//
//*****************************************************************************
#define MPU9150_I2C_MST_DELAY_CTRL_DELAY_ES_SHADOW                            \
                                0x80        // Delay external sensor data
#define MPU9150_I2C_MST_DELAY_CTRL_I2C_SLV4_DLY_EN                            \
                                0x10        // I2C slave 4 delay enable
#define MPU9150_I2C_MST_DELAY_CTRL_I2C_SLV3_DLY_EN                            \
                                0x08        // I2C slave 3 delay enable
#define MPU9150_I2C_MST_DELAY_CTRL_I2C_SLV2_DLY_EN                            \
                                0x04        // I2C slave 2 delay enable
#define MPU9150_I2C_MST_DELAY_CTRL_I2C_SLV1_DLY_EN                            \
                                0x02        // I2C slave 1 delay enable
#define MPU9150_I2C_MST_DELAY_CTRL_I2C_SLV0_DLY_EN                            \
                                0x01        // I2C slave 0 delay enable

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_SIGNAL_PATH_RESET register.
//
//*****************************************************************************
#define MPU9150_SIGNAL_PATH_RESET_GYRO                                        \
                                0x04        // Reset gyro
#define MPU9150_SIGNAL_PATH_RESET_ACCEL                                       \
                                0x02        // Reset accelerometer
#define MPU9150_SIGNAL_PATH_RESET_TEMP                                        \
                                0x01        // Reset temperature sensor

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU9150_O_MOT_DETECT_CTRL register.
//
//*****************************************************************************
#define MPU9150_MOT_DETECT_CTRL_ACCEL_ON_DELAY_M                              \
                                0x30        // Accelerometer wake-up delay
#define MPU9150_MOT_DETECT_CTRL_ACCEL_ON_DELAY_4MS                            \
                                0x00        // Delay 4 ms
#define MPU9150_MOT_DETECT_CTRL_ACCEL_ON_DELAY_5MS                            \
                                0x10        // Delay 5 ms
#define MPU9150_MOT_DETECT_CTRL_ACCEL_ON_DELAY_6MS                            \
                                0x20        // Delay 6 ms
#define MPU9150_MOT_DETECT_CTRL_ACCEL_ON_DELAY_7MS                            \
                                0x30        // Delay 7 ms
#define MPU9150_MOT_DETECT_CTRL_FF_COUNT_M                                    \
                                0x0C        // Free-fall counter decrement rate
#define MPU9150_MOT_DETECT_CTRL_FF_COUNT_RESET                                \
                                0x00        // Reset counter
#define MPU9150_MOT_DETECT_CTRL_FF_COUNT_1                                    \
                                0x04        // Decrement by 1
#define MPU9150_MOT_DETECT_CTRL_FF_COUNT_2                                    \
                                0x08        // Decrement by 2
#define MPU9150_MOT_DETECT_CTRL_FF_COUNT_4                                    \
                                0x0C        // Decrement by 4
#define MPU9150_MOT_DETECT_CTRL_MOT_COUNT_M                                   \
                                0x03        // Motion detect counter decrement
                                            // rate
#define MPU9150_MOT_DETECT_CTRL_MOT_COUNT_RESET                               \
                                0x00        // Reset counter
#define MPU9150_MOT_DETECT_CTRL_MOT_COUNT_1                                   \
                                0x04        // Decrement by 1
#define MPU9150_MOT_DETECT_CTRL_MOT_COUNT_2                                   \
                                0x08        // Decrement by 2
#define MPU9150_MOT_DETECT_CTRL_MOT_COUNT_4                                   \
                                0x0C        // Decrement by 4
#define MPU9150_MOT_DETECT_CTRL_ACCEL_ON_DELAY_S                              \
                                4
#define MPU9150_MOT_DETECT_CTRL_FF_COUNT_S                                    \
                                2
#define MPU9150_MOT_DETECT_CTRL_MOT_COUNT_S                                   \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_USER_CTRL
// register.
//
//*****************************************************************************
#define MPU9150_USER_CTRL_FIFO_EN                                             \
                                0x40        // FIFO enable
#define MPU9150_USER_CTRL_I2C_MST_EN                                          \
                                0x20        // I2C master mode enable
#define MPU9150_USER_CTRL_I2C_IF_DIS                                          \
                                0x10        // Write as zero
#define MPU9150_USER_CTRL_FIFO_RESET                                          \
                                0x04        // Reset FIFO buffer
#define MPU9150_USER_CTRL_I2C_MST_RESET                                       \
                                0x02        // Reset I2C master
#define MPU9150_USER_CTRL_SIG_COND_RESET                                      \
                                0x01        // Reset all sensors

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_PWR_MGMT_1
// register.
//
//*****************************************************************************
#define MPU9150_PWR_MGMT_1_DEVICE_RESET                                       \
                                0x80        // Device reset
#define MPU9150_PWR_MGMT_1_SLEEP                                              \
                                0x40        // Enter sleep mode
#define MPU9150_PWR_MGMT_1_CYCLE                                              \
                                0x20        // Enable automatic sleep
#define MPU9150_PWR_MGMT_1_TEMP_DIS                                           \
                                0x08        // Disable temperature sensor
#define MPU9150_PWR_MGMT_1_CLKSEL_M                                           \
                                0x07        // Clock source select
#define MPU9150_PWR_MGMT_1_CLKSEL_INT                                         \
                                0x00        // Internal 8 MHz oscillator
#define MPU9150_PWR_MGMT_1_CLKSEL_XG                                          \
                                0x01        // PLL with X-axis gyro reference
#define MPU9150_PWR_MGMT_1_CLKSEL_YG                                          \
                                0x02        // PLL with Y-axis gyro reference
#define MPU9150_PWR_MGMT_1_CLKSEL_ZG                                          \
                                0x03        // PLL with Z-axis gyro reference
#define MPU9150_PWR_MGMT_1_CLKSEL_EXT32K                                      \
                                0x04        // PLL with external 32.768 kHz
                                            // reference
#define MPU9150_PWR_MGMT_1_CLKSEL_EXT19M                                      \
                                0x05        // PLL with external 19.2 MHz
                                            // reference
#define MPU9150_PWR_MGMT_1_CLKSEL_STOP                                        \
                                0x07        // Clock disable
#define MPU9150_PWR_MGMT_1_CLKSEL_S                                           \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_PWR_MGMT_2
// register.
//
//*****************************************************************************
#define MPU9150_PWR_MGMT_2_LP_WAKE_CTRL_M                                     \
                                0xC0        // Wake-up frequency
#define MPU9150_PWR_MGMT_2_LP_WAKE_CTRL_1_25                                  \
                                0x00        // Wake-up at 1.25 Hz
#define MPU9150_PWR_MGMT_2_LP_WAKE_CTRL_5                                     \
                                0x40        // Wake-up at 5 Hz
#define MPU9150_PWR_MGMT_2_LP_WAKE_CTRL_20                                    \
                                0x80        // Wake-up at 20 Hz
#define MPU9150_PWR_MGMT_2_LP_WAKE_CTRL_40                                    \
                                0xC0        // Wake-up at 40 Hz
#define MPU9150_PWR_MGMT_2_STBY_XA                                            \
                                0x20        // Put X-axis accelerometer into
                                            // standby mode
#define MPU9150_PWR_MGMT_2_STBY_YA                                            \
                                0x10        // Put Y-axis accelerometer into
                                            // standby mode
#define MPU9150_PWR_MGMT_2_STBY_ZA                                            \
                                0x08        // Put Z-axis accelerometer into
                                            // standby mode
#define MPU9150_PWR_MGMT_2_STBY_XG                                            \
                                0x04        // Put X-axis gyro into standby
                                            // mode
#define MPU9150_PWR_MGMT_2_STBY_YG                                            \
                                0x02        // Put Y-axis gyro into standby
                                            // mode
#define MPU9150_PWR_MGMT_2_STBY_ZG                                            \
                                0x01        // Put Z-axis gyro into standby
                                            // mode
#define MPU9150_PWR_MGMT_2_LP_WAKE_CTRL_S                                     \
                                6

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_FIFO_COUNTH
// register.
//
//*****************************************************************************
#define MPU9150_FIFO_COUNTH_M   0x07        // FIFO count [10:8]
#define MPU9150_FIFO_COUNTH_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_FIFO_COUNTL
// register.
//
//*****************************************************************************
#define MPU9150_FIFO_COUNTL_M   0xFF        // FIFO count [7:0]
#define MPU9150_FIFO_COUNTL_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_FIFO_R_W
// register.
//
//*****************************************************************************
#define MPU9150_FIFO_R_W_M      0xFF        // FIFO data
#define MPU9150_FIFO_R_W_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_WHO_AM_I
// register.
//
//*****************************************************************************
#define MPU9150_WHO_AM_I_M      0x7E        // I2C address
#define MPU9150_WHO_AM_I_MPU9150                                              \
                                0x68        // MPU9150
#define MPU9150_WHO_AM_I_S      1

#endif // __SENSORLIB_HW_MPU9150_H__
